Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
#include <ESP8266WiFi.h>
#include <ArduinoJson.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>
#include <EEPROM.h>
#include <ESP8266mDNS.h>
#include "config.h"

// Forward declarations
void initializeOutputs();
void initializeWiFi();
void initializeWiFiManager();
void checkConfigPortalTrigger();
void initializeWebServer();
void executeOutputCommand(int pin, bool active, int brightnessPercent);
void updateBlinkingOutputs();
void updateChasingLightGroups();
void setOutputInterval(int index, unsigned int intervalMs);
void createChasingGroup(uint8_t groupId, uint8_t* outputIndices, uint8_t count, unsigned int intervalMs);
void deleteChasingGroup(uint8_t groupId);
void saveChasingGroups();
void loadChasingGroups();
void saveOutputState(int index);
void loadOutputStates();
void saveAllOutputStates();
void saveCustomParameters();
void loadCustomParameters();

// Global variables
// Web Server
ESP8266WebServer* server = nullptr;
WiFiManager wifiManager;

#define MAX_CHASING_GROUPS 4

// Chasing group structure
struct ChasingGroup {
    uint8_t groupId;
    bool active;
    char name[21]; // 20 chars + null terminator
    uint8_t outputIndices[8]; // Max 8 outputs per group
    uint8_t outputCount;
    uint16_t interval; // Step interval in ms
    uint8_t currentStep; // Current active output in sequence
    unsigned long lastStepTime;
};

// EEPROM structure for ESP8266
struct EEPROMData {
    char deviceName[40];
    bool outputStates[8];
    uint8_t outputBrightness[8];
    char outputNames[8][21]; // 20 chars + null terminator
    uint16_t outputIntervals[8]; // Blink interval in milliseconds (0 = no blink)
    // Chasing groups data
    uint8_t chasingGroupCount;
    struct {
        uint8_t groupId;
        bool active;
        char name[21];
        uint8_t outputIndices[8];
        uint8_t outputCount;
        uint16_t interval;
    } chasingGroups[MAX_CHASING_GROUPS];
    uint8_t checksum;
};
EEPROMData eepromData;

String macAddress;
char customDeviceName[40] = DEVICE_NAME; // Custom device name from WiFiManager
bool portalRunning = false;
unsigned long portalButtonPressTime = 0;
bool wifiConnected = false;

// Output pin configuration
int outputPins[MAX_OUTPUTS] = LED_PINS;
bool outputStates[MAX_OUTPUTS] = {false};
int outputBrightness[MAX_OUTPUTS] = {255}; // 0-255 for PWM
String outputNames[MAX_OUTPUTS]; // Custom names for outputs
unsigned int outputIntervals[MAX_OUTPUTS] = {0}; // Blink interval in ms (0 = no blink)
unsigned long lastBlinkTime[MAX_OUTPUTS] = {0}; // Last blink toggle time
bool blinkState[MAX_OUTPUTS] = {false}; // Current blink state (for internal tracking)
int8_t outputChasingGroup[MAX_OUTPUTS] = {-1, -1, -1, -1, -1, -1, -1}; // Which chasing group owns this output (-1 = none)

// Chasing light groups
ChasingGroup chasingGroups[MAX_CHASING_GROUPS];
uint8_t chasingGroupCount = 0;

// Timing variables

void setup() {
    Serial.begin(115200);
    delay(100);
    
    // Initialize EEPROM for ESP8266
    EEPROM.begin(EEPROM_SIZE);
    
    Serial.println("\n\n========================================");
    Serial.println("  RailHub8266 ESP8266 Controller v1.0");
    Serial.println("========================================");
    Serial.println("[BOOT] Chip ID: " + String(ESP.getChipId(), HEX));
    Serial.println("[BOOT] CPU Frequency: " + String(ESP.getCpuFreqMHz()) + " MHz");
    Serial.println("[BOOT] Flash Size: " + String(ESP.getFlashChipSize() / 1024) + " KB");
    Serial.println("[BOOT] Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
    
    // Get MAC address for unique identification
    macAddress = WiFi.macAddress();
    Serial.println("[INIT] MAC Address: " + macAddress);
    
    // Initialize portal trigger pin
    Serial.println("[INIT] Configuring portal trigger pin (GPIO " + String(PORTAL_TRIGGER_PIN) + ")");
    pinMode(PORTAL_TRIGGER_PIN, INPUT_PULLUP);
    
    // Initialize output pins
    Serial.println("[INIT] Initializing " + String(MAX_OUTPUTS) + " output pins...");
    initializeOutputs();
    
    // Load custom parameters from preferences
    Serial.println("[INIT] Loading custom parameters from NVRAM...");
    loadCustomParameters();
    
    // Load saved output states from NVRAM
    Serial.println("[INIT] Loading saved output states...");
    loadOutputStates();
    
    // Load chasing groups
    Serial.println("[INIT] Loading chasing groups...");
    loadChasingGroups();
    
    // Initialize WiFi with WiFiManager
    Serial.println("[INIT] Initializing WiFi Manager...");
    initializeWiFiManager();
    
    // Initialize web server after WiFi is connected
    if (wifiConnected) {
        Serial.println("[INIT] Starting web server on port 80...");
        server = new ESP8266WebServer(80);
        initializeWebServer();
        Serial.println("[WEB] Web server initialized successfully");
    } else {
        Serial.println("[WARN] WiFi not connected - web server not started");
    }
    
    Serial.println("\n========================================");
    Serial.println("  Setup Complete!");
    Serial.println("========================================");
    Serial.println("[INFO] Device Name: " + String(customDeviceName));
    Serial.println("[INFO] Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
    Serial.println("[INFO] System ready for operation\n");
}

void loop() {
    // Check for config portal trigger button
    checkConfigPortalTrigger();
    
    // Handle web server requests
    if (server) {
        server->handleClient();
    }
    
    // Update mDNS responder
    MDNS.update();
    
    // Update chasing light groups (has priority)
    updateChasingLightGroups();
    
    // Update blinking outputs (only for non-chasing outputs)
    updateBlinkingOutputs();
    
    // Handle any other tasks
    yield();
}

// Periodic status logging (called every 60 seconds via timer)
void logSystemStatus() {
    static unsigned long lastStatusLog = 0;
    unsigned long currentMillis = millis();
    
    if (currentMillis - lastStatusLog >= 60000) {
        lastStatusLog = currentMillis;
        Serial.println("\n[STATUS] === System Status Report ===");
        Serial.println("[STATUS] Uptime: " + String(currentMillis / 1000) + " seconds");
        Serial.println("[STATUS] Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
        Serial.println("[STATUS] WiFi Status: " + String(WiFi.isConnected() ? "Connected" : "Disconnected"));
        if (WiFi.isConnected()) {
            Serial.println("[STATUS] IP Address: " + WiFi.localIP().toString());
            Serial.println("[STATUS] RSSI: " + String(WiFi.RSSI()) + " dBm");
        }
        
        // Count active outputs
        int activeCount = 0;
        for (int i = 0; i < MAX_OUTPUTS; i++) {
            if (outputStates[i]) activeCount++;
        }
        Serial.println("[STATUS] Active Outputs: " + String(activeCount) + "/" + String(MAX_OUTPUTS));
        Serial.println("[STATUS] ========================\n");
    }
}

