Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
            for (int j = 0; j < chasingGroups[i].outputCount; j++) {
                uint8_t idx = eepromData.chasingGroups[i].outputIndices[j];
                chasingGroups[i].outputIndices[j] = idx;
                if (idx < MAX_OUTPUTS) {
                    outputChasingGroup[idx] = chasingGroups[i].groupId;
                }
            }
            
            loadedGroups++;
            
            Serial.print("[CHASING] Loaded group ");
            Serial.print(chasingGroups[i].groupId);
            Serial.print(" '");
            Serial.print(chasingGroups[i].name);
            Serial.print("' with ");
            Serial.print(chasingGroups[i].outputCount);
            Serial.print(" outputs, interval: ");
            Serial.print(chasingGroups[i].interval);
            Serial.println("ms");
        } else {
            chasingGroups[i].active = false;
            chasingGroups[i].outputCount = 0;
        }
    }
    
    Serial.print("[EEPROM] Loaded ");
    Serial.print(loadedGroups);
    Serial.println(" chasing groups");
}

void loadCustomParameters() {
    Serial.println("[EEPROM] Loading custom parameters...");
    
    // Read EEPROM data
    EEPROM.get(0, eepromData);
    
    // Check if data is valid (simple check - not empty)
    if (eepromData.deviceName[0] != '\0' && eepromData.deviceName[0] != 0xFF) {
        strncpy(customDeviceName, eepromData.deviceName, 39);
        customDeviceName[39] = '\0';
        Serial.print("[EEPROM] Loaded custom device name: '");
        Serial.print(customDeviceName);
        Serial.println("'");
    } else {
        strncpy(customDeviceName, DEVICE_NAME, 39);
        customDeviceName[39] = '\0';
        Serial.print("[EEPROM] No custom device name found, using default: '");
        Serial.print(customDeviceName);
        Serial.println("'");
    }
}

void executeOutputCommand(int pin, bool active, int brightnessPercent) {
    unsigned long startTime = millis();
    
    // Find the output index for the given pin
    int outputIndex = -1;
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        if (outputPins[i] == pin) {
            outputIndex = i;
            break;
        }
    }
    
    if (outputIndex == -1) {
        Serial.println("[ERROR] Invalid GPIO pin: " + String(pin));
        return;
    }
    
    // Validate brightness range
    if (brightnessPercent < 0 || brightnessPercent > 100) {
        Serial.println("[ERROR] Invalid brightness: " + String(brightnessPercent) + "% (must be 0-100)");
        brightnessPercent = constrain(brightnessPercent, 0, 100);
    }
    
    // Update state
    outputStates[outputIndex] = active;
    outputBrightness[outputIndex] = map(brightnessPercent, 0, 100, 0, 255);
    
    // Apply the command
    if (active) {
        analogWrite(outputPins[outputIndex], outputBrightness[outputIndex]);
    } else {
        analogWrite(outputPins[outputIndex], 0);
    }
    
    // Save the state to persistent storage
    saveOutputState(outputIndex);
    
    unsigned long duration = millis() - startTime;
    String nameStr = outputNames[outputIndex].length() > 0 ? " [" + outputNames[outputIndex] + "]" : "";
    Serial.println("[CMD] Output " + String(outputIndex) + " (GPIO " + String(pin) + ")" + nameStr + ": " + 
                   (active ? "ON" : "OFF") + " @ " + String(brightnessPercent) + "% (" + String(duration) + "ms)");
}

void saveOutputState(int index) {
    if (index < 0 || index >= MAX_OUTPUTS) {
        Serial.print("[ERROR] Invalid output index for state save: ");
        Serial.println(index);
        return;
    }
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // Update specific output
    eepromData.outputStates[index] = outputStates[index];
    eepromData.outputBrightness[index] = outputBrightness[index];
    eepromData.outputIntervals[index] = outputIntervals[index];
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
    Serial.print("[EEPROM] Saved state for Output ");
    Serial.print(index);
    Serial.print(" (GPIO ");
    Serial.print(outputPins[index]);
    Serial.print("): ");
    Serial.print(outputStates[index] ? "ON" : "OFF");
    Serial.print(" @ ");
    Serial.print(outputBrightness[index]);
    Serial.print(" PWM, Interval: ");
    Serial.print(outputIntervals[index]);
    Serial.println("ms");
}

void saveOutputName(int index, String name) {
    if (index < 0 || index >= MAX_OUTPUTS) {
        Serial.println("[ERROR] Invalid output index for name save: " + String(index));
        return;
    }
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // If name is empty or whitespace-only, clear the name
    name.trim(); // Trim modifies in place
    if (name.length() == 0) {
        eepromData.outputNames[index][0] = '\0';
        outputNames[index] = "";
        EEPROM.put(0, eepromData);
        EEPROM.commit();
        Serial.println("[EEPROM] Removed custom name for Output " + String(index) + " (GPIO " + String(outputPins[index]) + ") - using default");
        return;
    }
    
    // Copy name to EEPROM structure (max 20 chars + null)
    strncpy(eepromData.outputNames[index], name.c_str(), 20);
    eepromData.outputNames[index][20] = '\0';
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
    outputNames[index] = name;
    Serial.println("[EEPROM] Saved name for Output " + String(index) + " (GPIO " + String(outputPins[index]) + "): '" + name + "'");
}

void loadOutputStates() {
    Serial.println("[EEPROM] Loading saved output states...");
    
    // Read EEPROM data
    EEPROM.get(0, eepromData);
    
    // Check if data is valid (check for uninitialized EEPROM)
    bool validData = true;
    
    // Check device name for 0xFF pattern (uninitialized)
    if (eepromData.deviceName[0] == 0xFF) {
        validData = false;
    }
    
    // Check brightness values
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        if (eepromData.outputBrightness[i] > 255) {
            validData = false;
            break;
        }
    }
    
    // Initialize with defaults if invalid
    if (!validData) {
        Serial.println("[EEPROM] No valid data found, initializing defaults");
        
        // Clear entire structure
        memset(&eepromData, 0, sizeof(eepromData));
        
        // Set defaults
        for (int i = 0; i < MAX_OUTPUTS; i++) {
            eepromData.outputStates[i] = false;
            eepromData.outputBrightness[i] = 255;
            eepromData.outputNames[i][0] = '\0';
            eepromData.outputIntervals[i] = 0;
        }
        
        // Initialize chasing groups
        eepromData.chasingGroupCount = 0;
        for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
            eepromData.chasingGroups[i].active = false;
            eepromData.chasingGroups[i].outputCount = 0;
        }
        
