Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        strncpy(eepromData.deviceName, DEVICE_NAME, 39);
        eepromData.deviceName[39] = '\0';
        
        EEPROM.put(0, eepromData);
        EEPROM.commit();
        Serial.println("[EEPROM] Defaults saved to EEPROM");
    }
    
    int loadedCount = 0;
    int namedCount = 0;
    int blinkingCount = 0;
    
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        // Load state and brightness from EEPROM
        outputStates[i] = eepromData.outputStates[i];
        outputBrightness[i] = eepromData.outputBrightness[i];
        outputIntervals[i] = eepromData.outputIntervals[i];
        
        // Load custom name - validate it's printable ASCII
        if (eepromData.outputNames[i][0] != '\0' && 
            eepromData.outputNames[i][0] != 0xFF &&
            eepromData.outputNames[i][0] >= 32 && 
            eepromData.outputNames[i][0] <= 126) {
            // Ensure null termination
            eepromData.outputNames[i][20] = '\0';
            outputNames[i] = String(eepromData.outputNames[i]);
            namedCount++;
        } else {
            outputNames[i] = "";
        }
        
        // Apply the loaded state to the output
        if (outputStates[i]) {
            // If blinking is enabled, start in ON state
            if (outputIntervals[i] > 0) {
                analogWrite(outputPins[i], outputBrightness[i]);
                blinkState[i] = true;
                lastBlinkTime[i] = millis();
                blinkingCount++;
            } else {
                analogWrite(outputPins[i], outputBrightness[i]);
            }
            int brightPercent = map(outputBrightness[i], 0, 255, 0, 100);
            Serial.print("[EEPROM] Output " + String(i) + " (GPIO " + String(outputPins[i]) + "): ON @ " + String(brightPercent) + "%");
            if (outputIntervals[i] > 0) {
                Serial.print(" [Blink: " + String(outputIntervals[i]) + "ms]");
            }
            if (outputNames[i].length() > 0) {
                Serial.println(" [Name: " + outputNames[i] + "]");
            } else {
                Serial.println("");
            }
            loadedCount++;
        } else {
            analogWrite(outputPins[i], 0);
            blinkState[i] = false;
        }
    }
    
    Serial.println("[EEPROM] Loaded " + String(loadedCount) + " active outputs, " + String(namedCount) + " custom names, " + String(blinkingCount) + " blinking");
}

void saveAllOutputStates() {
    unsigned long startTime = millis();
    Serial.println("[EEPROM] Saving all output states (batch operation)...");
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // Update all output states and brightness
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        eepromData.outputStates[i] = outputStates[i];
        eepromData.outputBrightness[i] = outputBrightness[i];
        eepromData.outputIntervals[i] = outputIntervals[i];
    }
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
    unsigned long duration = millis() - startTime;
    Serial.print("[EEPROM] Batch save complete: ");
    Serial.print(MAX_OUTPUTS);
    Serial.print(" outputs saved (");
    Serial.print(duration);
    Serial.println("ms)");
}

void updateChasingLightGroups() {
    unsigned long currentMillis = millis();
    
    for (int g = 0; g < MAX_CHASING_GROUPS; g++) {
        ChasingGroup* group = &chasingGroups[g];
        
        if (!group->active || group->outputCount == 0) continue;
        
        // Check if it's time to step to next output
        if (currentMillis - group->lastStepTime >= group->interval) {
            // Turn off current output
            uint8_t currentIdx = group->outputIndices[group->currentStep];
            if (currentIdx < MAX_OUTPUTS) {
                analogWrite(outputPins[currentIdx], 0);
                Serial.print("[CHASING] Group ");
                Serial.print(group->groupId);
                Serial.print(" OFF: idx=");
                Serial.print(currentIdx);
                Serial.print(" GPIO=");
                Serial.println(outputPins[currentIdx]);
            }
            
            // Move to next step
            group->currentStep = (group->currentStep + 1) % group->outputCount;
            group->lastStepTime = currentMillis;
            
            // Turn on next output (always, regardless of state)
            uint8_t nextIdx = group->outputIndices[group->currentStep];
            if (nextIdx < MAX_OUTPUTS) {
                analogWrite(outputPins[nextIdx], outputBrightness[nextIdx]);
                Serial.print("[CHASING] Group ");
                Serial.print(group->groupId);
                Serial.print(" ON: idx=");
                Serial.print(nextIdx);
                Serial.print(" GPIO=");
                Serial.println(outputPins[nextIdx]);
            }
        }
    }
}

void updateBlinkingOutputs() {
    unsigned long currentMillis = millis();
    
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        // Skip if output is part of a chasing group
        if (outputChasingGroup[i] >= 0) continue;
        
        // Only process if output is active and has a blink interval set
        if (outputStates[i] && outputIntervals[i] > 0) {
            // Check if it's time to toggle
            if (currentMillis - lastBlinkTime[i] >= outputIntervals[i]) {
                lastBlinkTime[i] = currentMillis;
                blinkState[i] = !blinkState[i];
                
                // Toggle the output
                if (blinkState[i]) {
                    analogWrite(outputPins[i], outputBrightness[i]);
                } else {
                    analogWrite(outputPins[i], 0);
                }
            }
        } else if (outputStates[i] && outputIntervals[i] == 0) {
            // No blinking - ensure output is solid on
            if (!blinkState[i]) {
                analogWrite(outputPins[i], outputBrightness[i]);
                blinkState[i] = true;
            }
        }
    }
}

void createChasingGroup(uint8_t groupId, uint8_t* outputIndices, uint8_t count, unsigned int intervalMs, const char* groupName = nullptr) {
    if (groupId >= MAX_CHASING_GROUPS || count == 0 || count > 8) {
        Serial.println("[ERROR] Invalid chasing group parameters");
        return;
    }
    
    // Find or create group slot
    int groupSlot = -1;
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (chasingGroups[i].groupId == groupId || !chasingGroups[i].active) {
            groupSlot = i;
            break;
        }
    }
    
    if (groupSlot == -1) {
        Serial.println("[ERROR] No available chasing group slots");
        return;
    }
    
